fonecmid-diplom.Расширение/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="02ae4dca-90c9-4533-a8d2-45f7c925e1e1">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="56e1be80-538e-4a1a-bac3-d0265e273da1">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7ac2c20-577c-4b41-9689-ee5f9e0b5bea">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a45cfae-866d-46e0-8b7b-cd53f207caca">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="81456f51-5c22-4e0b-93c2-ef6f998543dc">
    <name>Услуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="28f19144-e851-4054-8409-ddbcc0e4ecb2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7fab7720-d7bd-4002-8786-6ffa8c2bbaed">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9b517798-39a1-44eb-9dba-ffa1d1925efa">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a89a48c2-2304-4820-bd36-596a68679149">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom.Расширение/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4bcf5efc-d119-4131-835d-815195fc8c51">
  <name>ВидыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
  <enumValues extendedConfigurationObject="05cf7625-5d6d-4d47-80fe-ad6a90a4e195">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom.Расширение/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы



&После("ПриСозданииНаСервере")
&НаСервере
Процедура ВКМ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Добавить команду Заполнить
	КЗапол = Команды.Добавить("КомандаЗаполнить");
	КЗапол.Заголовок= "Заполнить абонентским обслуживанием";
	КЗапол.Действие = "ВКМ_ВыполнитьКомандаЗаполнить";
	
	КнЗапол = Элементы.Добавить("Заполнить",тип("КнопкаФормы"),КоманднаяПанель );
	КнЗапол.ИмяКоманды = "КомандаЗаполнить";
	КнЗапол.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	//добавить в отбор договоров договоры обслуживания
	МВидыДогов = Новый Массив;
	МВидыДогов.Добавить(Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	МВидыДогов.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Покупатель);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидДоговора", МВидыДогов);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Договор.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры




#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВКМ_ВыполнитьКомандаЗаполнить(Команда)
	ВКМ_ВыполнитьКомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВКМ_ВыполнитьКомандаЗаполнитьНаСервере()
	ВидДог = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"ВидДоговора" );
	Если ВидДог = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		ДокуменОбъект = РеквизитФормыВЗначение("Объект");
		ДокуменОбъект.ВКМ_ВыполнитьАвтозаполнение();
		КонецЕсли;
КонецПроцедуры

#КонецОбласти
